{
    "homePageText": "I'm always working on a personal project to practice every skill that I learn. You can take a look at some of them in the Projects page.",
    "projects": [
        {
            "title": "Infinity Run",
            "description": "<p>A prototype for an endless runner game made in Unity for Android devices, inspired by Temple Run and Subway Surfers.</p><p>It's still in development, but I plan to upload it to the Play Store once it gets in a playable state.</p><p>It currently has randomized obstacles, coins and ground slope. And I plan to add more obstacles, enemies and power-ups.</p>",
            "imageSrc": "projects/runner.png",
            "repository": "https://github.com/LuzMurilo/infinity-run"
        },
        {
            "title": "Project Aster",
            "description": "<p>This project is a 2D metroidvania prototype.</p><p>It's currently in the concept phase and I still need to implement and test new ideas, and flesh out the design.</p><p>The video below show the most basic functionalities for movement and combat</p>",
            "videoSrc": "https://www.youtube.com/embed/hcM00nBz1a8",
            "imageSrc": "projects/aster.png",
            "repository": "https://gitlab.com/luzmurilo/project-aster"
        },
        {
            "title": "This Website",
            "description": "<p>I made this website with the goal of being a customizable portfolio, a place to show my projects and experiences with more details than a resume, and with my own style.</p><p>I used React.js with TypeScript, and pure CSS.",
            "imageSrc": "projects/portfolio.png",
            "repository": "https://github.com/LuzMurilo/portfolio-react"
        },
        {
            "title": "Constellation",
            "description": "<p>A game made for the Lost Relic GameJam 2022. </p> <p> The theme of the Jam was 'Connection', so I my idea was to make the theme present in the core mechanic of my game. </p> <p> In this game the goal is to make connections between the 'Stars' to form the right constellation. The player is able to shoot colored 'Planets' that orbit the Star it collides with, and if another Star has a planet of the same color, a connection is made.</p> <p> I developed this game from scratch in a week. All aspects, except the music, were made by me.</p>",
            "imageSrc": "projects/constellation.png",
            "repository": "https://gitlab.com/luzmurilo/moonshooter",
            "demo": "https://muriloluz.itch.io/constellation"
        }
    ],
    "endMessage": "Thank you for visiting my humble portfolio! I'm currently working on more front-end projects to learn new skills, so come back later to see my progress!"
}